## Create, Add, Update and Delete columns and rows in DF

In [2]:
import numpy as np
import pandas as pd

In [11]:
df1=pd.DataFrame({"Name":["A","B","C"],
                "Age":[10,20,30],
                "Gender":["F","M","F"]})

In [12]:
df1

  Name  Age Gender
0    A   10      F
1    B   20      M
2    C   30      F

In [14]:
df1["City"]=["Pune","Solapur","Pune"]

In [15]:
df1

  Name  Age Gender     City
0    A   10      F     Pune
1    B   20      M  Solapur
2    C   30      F     Pune

In [18]:
df1.rename(columns={"City":"Location"})

  Name  Age Gender Location
0    A   10      F     Pune
1    B   20      M  Solapur
2    C   30      F     Pune

In [20]:
df1["Named Location"]=df1["Name"]+" : "+df1["City"]

In [21]:
df1

  Name  Age Gender     City Named Location
0    A   10      F     Pune       A : Pune
1    B   20      M  Solapur    B : Solapur
2    C   30      F     Pune       C : Pune

In [26]:
df1=df1.assign(updated_age=df1["Age"]*0.9)

In [27]:
df1

  Name  Age Gender     City Named Location   Tax  updated_age
0    A   10      F     Pune       A : Pune   9.0          9.0
1    B   20      M  Solapur    B : Solapur  18.0         18.0
2    C   30      F     Pune       C : Pune  27.0         27.0